//---------------------------------------------------------------------------
#include <vcl.h>
#pragma hdrstop

#include "FreePropFrm.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
//---------------------------------------------------------------------------
__fastcall TFFreeProp::TFFreeProp(TComponent *Owner)
                      :TForm(Owner)
{
	LFormula->Hint = "Доступные функции (x - входной сигнал):\n";
   LFormula->Hint += "sin(x) - синус; arcsin(x) - арксинус; cos(x) - косинус; arccos(x) - арккосинус;\n";
   LFormula->Hint += "tg(x) - тангенс; arctg(x) - арктангенс; ctg(x) - котангенс; arcctg(x) - арккотангенс;\n";
   LFormula->Hint += "ln(x) - натуральный логарифм; log2(x) - логарифм по основанию 2; lg(x) - десятичный логарифм;\n";
   LFormula->Hint += "root(x) - квадратный корень\n";
   LFormula->Hint += "Доступные операции: +;-;*;/;^";
}
//---------------------------------------------------------------------------
